[
    {
        "course": "Steven Feiner",
        "date": "Sep 3, 2025",
        "text": "Class is not as bad as reviews claim -- the prof covers a lot of dense content quite quickly. If you're interested in graphics/vr/ar it's incredibly interesting, but thankfully it's never really tested on paper, only on how you apply high-level concepts. I personally enjoyed the content a lot and would really recommend it, being the most interesting class I took last semester by far. Becoming very familiar with Unity by the end of the course was also a big plus. The TAs are also really cool and interesting people, and I loved talking to them during workshops and such."
    },
    {
        "course": "Steven Feiner",
        "date": "May 19, 2025",
        "text": "The description for this class could never have prepared me for how horrible this class is. The grade based purely on the coding assignments, and his lectures are incredibly boring and completely unrelated to the assignments. Feiner is the WORST professor I have ever had in all my time at Columbia."
    },
    {
        "course": "Steven Feiner",
        "date": "Oct 22, 2019",
        "text": "I strongly suggest you to NOT take this course. The title of the course is very misleading. There is nothing about AR in such. The course is all about UI and graphics, and the professor does not want you to do any new things in his course. Any new idea will be crushed by professor and his some puppet lab assistant who are equally rude as him. The course content has nothing to do with the assignments or the final project you get. For the first half of the class his slides as basically history classes for graphics and you get to learn nothing. If you want to get grade in this class you need to be in his lab all the time just do what he says basically just follow him and forget the other courses you take. No matter what project you do you will not get marks because he neither tell you anything that is wrong with your project nor gives any suggestions until the final presentation by then you are basically screwed. My language might be harsh but this is nothing in comparison to the disappointment we got after taking this class."
    }
]